#данный файл для лога действий и логики юишки и процесса картинок + безопасный запуск 
import json
import os
from datetime import datetime#импорты
HISTORY_FILE = "logs/history.json"#константа
def log_action_to_json(operation: str, parameters: dict = None):#объявление функции- строка с названиема вот второе интересней, для добавочных изменений, по типу нового пути к файлу и егшо характеристик(новых)
    history_data = []#создание списка с записями
    if os.path.exists(HISTORY_FILE):#проверка на наличие джейсон файла
        try:#чет вроде безопасного запуска, благодаря этому, если возникает ошибка программа не вылетит
            with open(HISTORY_FILE, "r", encoding="utf-8") as f:#опять таки безопасное открытие "with open", а другая часть для чтения кирилицы
                history_data = json.load(f)#считывание текста из файла f
        except (json.JSONDecodeError, IOError):#при повреждении файла
            history_data = []#что то около аварийного списка, если возникает ошибка в чтении джейсона, срабатывает эта строка, которая сбрасывает старый список и делает пустой новый
#блок с новой записью
    record = {#словарь
        "date": datetime.now().strftime("%Y-%m-%d %H:%M:%S"),# чисто для красоты, хорошо форматирует в год-месяц-дату и т.п.
        "operation": operation,#запись выполненного действия
        "parameters": parameters or {}#запись вот в эти скобочки параметры функции, или их отсутствие = нону
    }
    history_data.append(record)#добавляет новую рекорд 
    with open(HISTORY_FILE, "w", encoding="utf-8") as f:# если при безопасном запуске все ок то тут тоже самое но уже на "чистовик"
        json.dump(history_data, f, indent=4, ensure_ascii=False)#по большей части для удобства чтения индент отступы а эншур для записи на кирилице файлов 